Tekla.Structures.Helper.AsyncFlag
The AsyncFlag class provides access to the flag that determines if invoke calls should be awaited or run Async

Tekla.Structures.Helper.AsyncFlag.IsAsyncInvoke
Gets a flag that determines if invoke calls should be awaited or run Async

Tekla.Structures.Helper.AsyncFlag.SetAsyncInvoke(System.Boolean)
Flag to "manually" set if invoke calls should be awaited or run Async
isAsync: true if not await required. False otherwise (e.g. for message Polling)